In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\suyas\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\suyas\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

user={
    "name":["suyash","abhay","tanveer"],
    "age":["23","24","25"]
}
df =pd.DataFrame(user)
print(df)

      name age
0   suyash  23
1    abhay  24
2  tanveer  25

In [3]:
df

      name age
0   suyash  23
1    abhay  24
2  tanveer  25

In [6]:
s=pd.Series(["23","32","25"], index=["Suyash","Abhay","Tanveer"])
print(s)
print(s["Abhay"])
print(s.index)

Suyash     23
Abhay      32
Tanveer    25
dtype: object
32
Index(['Suyash', 'Abhay', 'Tanveer'], dtype='object')

In [7]:
s1=pd.Series([10,20,30,40,50])
s2=pd.Series([23,45,66,77,78])
print(s1+s2)
s1[0]=100
c_s1=s1.drop(0)
print(s1)
print(c_s1)

0     33
1     65
2     96
3    117
4    128
dtype: int64
0    100
1     20
2     30
3     40
4     50
dtype: int64
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
df=pd.DataFrame([["ada",23],["bob",12],["alice",24]], columns=["name","age"])
print(df)

    name  age
0    ada   23
1    bob   12
2  alice   24

In [9]:
import numpy as np

np_arr=np.array([[1,2,3],[4,45,6]])
df=pd.DataFrame(np_arr,columns=["first","second","third"])
print(df)

   first  second  third
0      1       2      3
1      4      45      6

In [10]:
df=pd.read_csv("raw_data.csv")
print(df)

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [ ]:
df.nunique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       11 non-null     int64
 1   name     10 non-null     object
 2   age      8 non-null      float64
 3   country  10 non-null     object
 4   gender   10 non-null     object
 5   income   10 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 660.0+ bytes